Term4/matlog/lectures/14.tex
% Created 2022-06-11 Sat 01:27
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{fancyhdr}
\usepackage{lastpage}
\usepackage{titling}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{svg}
\usepackage{capt-of}
\newcommand{\gedel}[1]{\custombracket{\ulcorner}{\urcorner}{#1}}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\input{~/.emacs.d/preamble.sty}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 14}
\hypersetup{
	pdfauthor={Ilya Yaroshevskiy},
	pdftitle={Лекция 14},
	pdfkeywords={},
	pdfsubject={},
	pdfcreator={Emacs 28.1 (Org mode 9.5.3)},
	pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Теорема Левенгейма-Сголема}
\label{sec:org5dd97af}
\begin{definition}
	\textbf{Мощность модели}
	\begin{itemize}
		\item \(D\) --- предметное множество
	\end{itemize}
	Тогда \(|D|\) --- мощность модели
\end{definition}
\begin{definition}
	Пусть есть две модели \(M, M'\). \(M'\) --- \textbf{элементарная подмодель} \(M\), если
	\begin{itemize}
		\item предметное множество \(M' \subseteq\) предметное множество \(M\)
		\item пусть \(\vDash_M\varphi\), тогда \(\vDash_{M'}\varphi\)
		\item Все функции и предикаты \(M'\) --- сужение соответствующих функций и предикатов из \(M\)
	\end{itemize}
\end{definition}
\begin{theorem}
	Пусть задана теория и модель \(M\). Все ее формулы образуют множество \(T\) \\
	\uline{Тогда} для нее существует элементарная подмодель \(M'\)
	\[ |M'| = \max(|T|, \aleph_0) \]
	\label{org300d976}
\end{theorem}
\begin{proof}
	\(D_0 \subseteq D_1 \subseteq D_2 \subseteq \dots\) --- предметные множества. \(D_i \subseteq D\) \\
	\(D' = \bigcup D_i\) --- ?? предметное множество \\
	Рассмотрим все формулы из \(T\) \\
	Определим операцию преобразования \(D\):
	\[ \varphi \in T \quad \underset{y,x_i \in D_n}{\eval{\varphi(y, x_1, \dots x_k)}} = \text{И} \]
	\todo
\end{proof}
\begin{remark}
	\textbf{``Парадокс`` Сколема} \\
	Известно, что:
	\begin{enumerate}
		\item вещественные числа + матан --- счетно-аксиоматизированны
		\item \(|\R| > \aleph_0\) \color{gray} --- внутри теории, на предметном языке\color{black}
		\item У вещественных чисел есть счетная модель \(|\R| = \aleph_0\) --- по \hyperref[org300d976]{теореме} \color{gray} --- вне теории, на метаязыке\color{black}
	\end{enumerate}
	\label{org51c5238}
\end{remark}
\section{Про \(\omega\)}
\label{sec:orgb96b907}
\begin{definition}
	\[ a \cdot b = \begin{cases}
			0                           & b = 0                   \\
			a\cdot c + a                & b = c'                  \\
			\sup_{c \le b}\{a \cdot c\} & b\text{ --- предельный}
		\end{cases} \]
	\label{org8671887}
\end{definition}
\begin{remark}
	\[ \sup \omega = \omega \]
	\[ \cup \{\omega\} = \omega + 1 \]
\end{remark}
\begin{examp}
	\(\omega \cdot 1 < \omega \cdot 2\)
	\[ \omega + \omega = \sup \{\omega + 0, \omega + 1, \omega + 2, \dots\} \]
\end{examp}
\begin{examp}
	\((a, b) > (c, d)\), если
	\begin{enumerate}
		\item \(a > c\)
		\item \(a = c, b > d\)
	\end{enumerate}
	\((a, b) \to \omega \cdot a + b\)
	\begin{enumerate}
		\item \(a > c \implies \omega \cdot a + b > \omega \cdot c + d\)
		\item \(a = c, b > d \implies \omega \cdot a + b > \omega \cdot c + d\) \fixme
	\end{enumerate}
\end{examp}
\begin{examp}
	\[ \omega \cdot \omega = \sup \{\omega \cdot 0, \omega \cdot 1, \omega \cdot 2, \omega \cdot 3, \dots\} \]
\end{examp}
\begin{examp}
	\[ \omega^\omega = \sup \{\omega, \omega \cdot \omega, \omega \cdot \omega \cdot \omega, \dots\} \]
\end{examp}
\begin{examp}
	\(\omega + 1\)
	\begin{minted}[frame=lines,linenos=true,mathescape]{pascal}
  record:
         i: integer,
         case i of
           0 : a: boolean;
           1 : b: integer
         end
  end
\end{minted}
	\fixme
\end{examp}
\begin{examp}
	\(\omega + \omega + 2\)
	\begin{minted}[frame=lines,linenos=true,mathescape]{pascal}
  record:
         i: integer,
         case i of
           0 : a: integer;
           1 : b: integer;
           2 : c: boolean;
         end
  end
\end{minted}
\end{examp}
\end{document}
